abstractsig/io_stm32f405/stm32f4xx_peripherals.h
  /* Store the new value */
  RCC->DCKCFGR = tmpreg;
}

/**
  * @brief  Configures SAI1BlockB clock source selection.
  *
  * @note   This function can be used only for STM32F42xxx/43xxx/469xx/479xx devices.
  *
  * @note   This function must be called before enabling PLLSAI, PLLI2S and
  *         the SAI clock.
  * @param  RCC_SAIBlockBCLKSource: specifies the SAI Block B clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_SAIBCLKSource_PLLI2S: PLLI2S_Q clock divided by PLLI2SDIVQ used
  *                                           as SAI1 Block B clock
  *            @arg RCC_SAIBCLKSource_PLLSAI: PLLISAI_Q clock divided by PLLSAIDIVQ used
  *                                           as SAI1 Block B clock
  *            @arg RCC_SAIBCLKSource_Ext: External clock mapped on the I2S_CKIN pin
  *                                        used as SAI1 Block B clock
  * @retval None
  */
void RCC_SAIBlockBCLKConfig(uint32_t RCC_SAIBlockBCLKSource)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_RCC_SAIBCLK_SOURCE(RCC_SAIBlockBCLKSource));

  tmpreg = RCC->DCKCFGR;

  /* Clear RCC_DCKCFGR_SAI1BSRC[1:0] bits */
  tmpreg &= ~RCC_DCKCFGR_SAI1BSRC;

  /* Set SAI Block B source selection value */
  tmpreg |= RCC_SAIBlockBCLKSource;

  /* Store the new value */
  RCC->DCKCFGR = tmpreg;
}
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx */

/**
  * @brief  Configures the SAI clock Divider coming from PLLI2S.
  *
  * @note   This function can be used only for STM32F42xxx/43xxx/446xx/469xx/479xx devices.
  *
  * @note   This function must be called before enabling the PLLI2S.
  *
  * @param  RCC_PLLI2SDivQ: specifies the PLLI2S division factor for SAI1 clock .
  *          This parameter must be a number between 1 and 32.
  *          SAI1 clock frequency = f(PLLI2S_Q) / RCC_PLLI2SDivQ
  *
  * @retval None
  */
void RCC_SAIPLLI2SClkDivConfig(uint32_t RCC_PLLI2SDivQ)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_RCC_PLLI2S_DIVQ_VALUE(RCC_PLLI2SDivQ));

  tmpreg = RCC->DCKCFGR;

  /* Clear PLLI2SDIVQ[4:0] bits */
  tmpreg &= ~(RCC_DCKCFGR_PLLI2SDIVQ);

  /* Set PLLI2SDIVQ values */
  tmpreg |= (RCC_PLLI2SDivQ - 1);

  /* Store the new value */
  RCC->DCKCFGR = tmpreg;
}

/**
  * @brief  Configures the SAI clock Divider coming from PLLSAI.
  *
  * @note   This function can be used only for STM32F42xxx/43xxx/446xx/469xx/479xx devices.
  *
  * @note   This function must be called before enabling the PLLSAI.
  *
  * @param  RCC_PLLSAIDivQ: specifies the PLLSAI division factor for SAI1 clock .
  *          This parameter must be a number between 1 and 32.
  *          SAI1 clock frequency = f(PLLSAI_Q) / RCC_PLLSAIDivQ
  *
  * @retval None
  */
void RCC_SAIPLLSAIClkDivConfig(uint32_t RCC_PLLSAIDivQ)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_RCC_PLLSAI_DIVQ_VALUE(RCC_PLLSAIDivQ));

  tmpreg = RCC->DCKCFGR;

  /* Clear PLLI2SDIVQ[4:0] and PLLSAIDIVQ[4:0] bits */
  tmpreg &= ~(RCC_DCKCFGR_PLLSAIDIVQ);

  /* Set PLLSAIDIVQ values */
  tmpreg |= ((RCC_PLLSAIDivQ - 1) << 8);

  /* Store the new value */
  RCC->DCKCFGR = tmpreg;
}

#if defined(STM32F413_423xx)
/**
  * @brief  Configures the SAI clock Divider coming from PLLI2S.
  *
  * @note   This function can be used only for STM32F413_423xx
  *
  * @param   RCC_PLLI2SDivR: specifies the PLLI2S division factor for SAI1 clock.
  *          This parameter must be a number between 1 and 32.
  *          SAI1 clock frequency = f(PLLI2SR) / RCC_PLLI2SDivR
  * @retval None
  */
void RCC_SAIPLLI2SRClkDivConfig(uint32_t RCC_PLLI2SDivR)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_RCC_PLLI2S_DIVR_VALUE(RCC_PLLI2SDivR));

  tmpreg = RCC->DCKCFGR;

  /* Clear PLLI2SDIVR[4:0] bits */
  tmpreg &= ~(RCC_DCKCFGR_PLLI2SDIVR);

  /* Set PLLI2SDIVR values */
  tmpreg |= (RCC_PLLI2SDivR-1);

  /* Store the new value */
  RCC->DCKCFGR = tmpreg;
}

/**
  * @brief  Configures the SAI clock Divider coming from PLL.
  *
  * @note   This function can be used only for STM32F413_423xx
  *
  * @note   This function must be called before enabling the PLLSAI.
  *
  * @param  RCC_PLLDivR: specifies the PLL division factor for SAI1 clock.
  *          This parameter must be a number between 1 and 32.
  *          SAI1 clock frequency = f(PLLR) / RCC_PLLDivR
  *
  * @retval None
  */
void RCC_SAIPLLRClkDivConfig(uint32_t RCC_PLLDivR)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_RCC_PLL_DIVR_VALUE(RCC_PLLDivR));

  tmpreg = RCC->DCKCFGR;

  /* Clear PLLDIVR[12:8] */
  tmpreg &= ~(RCC_DCKCFGR_PLLDIVR);

  /* Set PLLDivR values */
  tmpreg |= ((RCC_PLLDivR - 1 ) << 8);

  /* Store the new value */
  RCC->DCKCFGR = tmpreg;
}
#endif /* STM32F413_423xx */

/**
  * @brief  Configures the LTDC clock Divider coming from PLLSAI.
  *
  * @note   The LTDC peripheral is only available with STM32F42xxx/43xxx/446xx/469xx/479xx Devices.
  *
  * @note   This function must be called before enabling the PLLSAI.
  *
  * @param  RCC_PLLSAIDivR: specifies the PLLSAI division factor for LTDC clock .
  *          LTDC clock frequency = f(PLLSAI_R) / RCC_PLLSAIDivR
  *          This parameter can be one of the following values:
  *            @arg RCC_PLLSAIDivR_Div2: LTDC clock = f(PLLSAI_R)/2
  *            @arg RCC_PLLSAIDivR_Div4: LTDC clock = f(PLLSAI_R)/4
  *            @arg RCC_PLLSAIDivR_Div8: LTDC clock = f(PLLSAI_R)/8
  *            @arg RCC_PLLSAIDivR_Div16: LTDC clock = f(PLLSAI_R)/16
  *
  * @retval None
  */
void RCC_LTDCCLKDivConfig(uint32_t RCC_PLLSAIDivR)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_RCC_PLLSAI_DIVR_VALUE(RCC_PLLSAIDivR));

  tmpreg = RCC->DCKCFGR;

  /* Clear PLLSAIDIVR[2:0] bits */
  tmpreg &= ~RCC_DCKCFGR_PLLSAIDIVR;

  /* Set PLLSAIDIVR values */
  tmpreg |= RCC_PLLSAIDivR;

  /* Store the new value */
  RCC->DCKCFGR = tmpreg;
}

#if defined(STM32F412xG) || defined(STM32F413_423xx)
/**
  * @brief  Configures the DFSDM clock source (DFSDMCLK).
  * @note   This function must be called before enabling the DFSDM APB clock.
  * @param  RCC_DFSDMCLKSource: specifies the DFSDM clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_DFSDMCLKSource_APB: APB clock used as DFSDM clock source.
  *            @arg RCC_DFSDMCLKSource_SYS: System clock used as DFSDM clock source.
  *
  * @retval None
  */
void RCC_DFSDM1CLKConfig(uint32_t RCC_DFSDMCLKSource)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_RCC_DFSDM1CLK_SOURCE(RCC_DFSDMCLKSource));

  tmpreg = RCC->DCKCFGR;

  /* Clear CKDFSDM-SEL  bit */
  tmpreg &= ~RCC_DCKCFGR_CKDFSDM1SEL;

  /* Set CKDFSDM-SEL bit according to RCC_DFSDMCLKSource value */
  tmpreg |= (RCC_DFSDMCLKSource << 31) ;

